# 1 Використовуємо офіційний легкий образ з Go
FROM golang:1.25.1-alpine AS builder

# 2 Встановлюємо директорію, де будемо працювати в контейнері
WORKDIR /app

# 3 Копіюємо файли модуля (щоб спочатку завантажити залежності)
COPY go.mod go.sum ./

# 4 Завантажуємо залежності (модулі Go)
RUN go mod download

# 5 Копіюємо весь проєкт до робочої директорії контейнера
COPY . .

# 6 Будуємо виконуваний файл (бінарник для сервера API Go Petshop )
RUN go build -o go_activity_service ./cmd/api

# 7 Фінальний образ без зайвого (маленький, швидкий для розгортання додатку в продакшн середовищі)
FROM alpine:latest

# 8 Директорія запуску додатку (користувача root для простоти налаштування права доступу до файлів в контейнері та хост-машині  )
WORKDIR /root/

# 9 Копіюємо готовий бінарник з попереднього етапу збірки до робочої директорії фінального образу (контейнера)
COPY --from=builder /app/go_activity_service .

# 10 Копіюємо файл налаштувань середовища .env (якщо є) до робочої директорії контейнера
COPY .env .env

# 11 Вказуємо порт (для інформації, не обов’язково відкривати його тут)
EXPOSE 8080

# 12 Команда, яка запускає додаток (сервер API Go Petshop ) при старті контейнера  (можна змінити на потрібну команду запуску)
CMD ["./go_activity_service"]
